### Terraform Initialization ``

### Terraform Validation `success`

<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

### Terraform Plan `success`

<details><summary>Show Plan</summary>

```

Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
  + create

Terraform will perform the following actions:

  # google_storage_bucket.WhenFresh_Data will be created
  + resource "google_storage_bucket" "WhenFresh_Data" {
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = (known after apply)
      + location                    = "EUROPE-NORTH1"
      + name                        = "sof-marketing-whenfresh-data"
      + project                     = "sof-mark-whenfresh-prod"
      + public_access_prevention    = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = true
      + url                         = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "automation" but a value

To silence these warnings, use TF_VAR_... environment variables to provide

Warning: Value for undeclared variable

The root module does not declare a variable named "net_host_project_number"

To silence these warnings, use TF_VAR_... environment variables to provide

Warning: Values for undeclared variables

In addition to the other similar warnings shown, 18 other variable(s) defined


Saved the plan to: ../plan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "../plan.out"
```

</details>

### Terraform Apply `failure`

*Pusher: @danwaller1984, Action: `pull_request`, Working Directory: ``, Workflow: `Telephony_POC_CICD`*